---
type: DialogBoxData
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DialogBoxData

`Autodesk.Revit.UI.Events.DialogBoxData` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OverrideResult | — | `public bool OverrideResult ( int result )` |
| Property | HelpId | — | `public int HelpId { get ; }` |